Revit 2024 API
BuiltInFailures.DPartFailures.PartPhaseParametersConflictWithOriginal Property
 The creation and demolition phases of a part must lie between the corresponding phases of the original.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId PartPhaseParametersConflictWithOriginal { get; }
Visual Basic
Public Shared ReadOnly Property PartPhaseParametersConflictWithOriginal As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ PartPhaseParametersConflictWithOriginal {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace